In [27]:
import confirm.cloud.clickhouse as ch

# Bdb = ch.Clickhouse.connect(job_id = '544d8afac72e4633809a162a480ed998')
Adb = ch.Clickhouse.connect(job_id="41ef6dbb374d4bb9a62a0ea8d98b5c9a")
Bdb = ch.Clickhouse.connect(job_id="0da447c75edf4ef7b2cc905c6c004952")

INFO:confirm.cloud.clickhouse:[worker_id=None]
Clickhouse config: default@t2n4z83v82.us-east-1.aws.clickhouse.cloud:8443/None
INFO:confirm.cloud.clickhouse:[worker_id=None]
Clickhouse config: default@t2n4z83v82.us-east-1.aws.clickhouse.cloud:8443/41ef6dbb374d4bb9a62a0ea8d98b5c9a
INFO:confirm.cloud.clickhouse:[worker_id=None]
Connected to job 41ef6dbb374d4bb9a62a0ea8d98b5c9a
INFO:confirm.cloud.clickhouse:[worker_id=None]
Clickhouse config: default@t2n4z83v82.us-east-1.aws.clickhouse.cloud:8443/None
INFO:confirm.cloud.clickhouse:[worker_id=None]
Clickhouse config: default@t2n4z83v82.us-east-1.aws.clickhouse.cloud:8443/0da447c75edf4ef7b2cc905c6c004952
INFO:confirm.cloud.clickhouse:[worker_id=None]
Connected to job 0da447c75edf4ef7b2cc905c6c004952

In [28]:
At = Adb.get_results()
Bt = Bdb.get_results()

In [29]:
At.shape, Bt.shape

((39, 32), (39, 32))

In [30]:
import pandas as pd

drop_cols = ["id", "parent_id", "step_iter", "creator_id", "processor_id", "creation_time", "processing_time"]

AAA = At.drop(drop_cols, axis=1).sort_values(['step_id', 'theta0']).reset_index(drop=True)
BBB = Bt.drop(drop_cols, axis=1).sort_values(['step_id', 'theta0']).reset_index(drop=True)
pd.testing.assert_frame_equal(AAA, BBB, check_dtype=False)

In [32]:
AAA['twb_max_lams'] - BBB['twb_max_lams']

0     0.0
1     0.0
2     0.0
3     0.0
4     0.0
5     0.0
6     0.0
7     0.0
8     0.0
9     0.0
10    0.0
11    0.0
12    0.0
13    0.0
14    0.0
15    0.0
16    0.0
17    0.0
18    0.0
19    0.0
20    0.0
21    0.0
22    0.0
23    0.0
24    0.0
25    0.0
26    0.0
27    0.0
28    0.0
29    0.0
30    0.0
31    0.0
32    0.0
33    0.0
34    0.0
35    0.0
36    0.0
37    0.0
38    0.0
Name: twb_max_lams, dtype: float64

In [31]:
pd.set_option('display.max_columns', None)
display(AAA.head(2)), display(BBB.head(2))

   theta0  radii0  null_truth0     K  step_id  grid_cost  impossible   orderer    alpha0  twb_max_lams  twb_mean_lams  twb_min_lams      lams   B_lams0   B_lams1   B_lams2   B_lams3   B_lams4  twb_lams0  twb_lams1  twb_lams2  twb_lams3  twb_lams4  active  eligible
0   -0.50    0.50            1  8192        0   0.019327           0 -2.041470  0.005673     -1.817141      -1.957940     -2.041470 -1.985793 -1.989771 -1.989771 -1.915074 -2.014259 -1.991126  -1.991126  -1.948838  -2.041470  -1.817141  -1.991126       0         0
1   -0.75    0.25            1  8192        1   0.012713           0 -1.481911  0.012287     -1.438797      -1.463035     -1.481911 -1.454579 -1.454579 -1.465404 -1.423409 -1.454579 -1.474801  -1.455609  -1.459480  -1.481911  -1.438797  -1.479379       0         0

   theta0  radii0  null_truth0     K  step_id  grid_cost  impossible   orderer    alpha0  twb_max_lams  twb_mean_lams  twb_min_lams      lams   B_lams0   B_lams1   B_lams2   B_lams3   B_lams4  twb_lams0  twb_lams1  twb_lams2  twb_lams3  twb_lams4  active  eligible
0   -0.50    0.50            1  8192        0   0.019327           0 -2.041470  0.005673     -1.817141      -1.957940     -2.041470 -1.985793 -1.989771 -1.989771 -1.915074 -2.014259 -1.991126  -1.991126  -1.948838  -2.041470  -1.817141  -1.991126       0         0
1   -0.75    0.25            1  8192        1   0.012713           0 -1.481911  0.012287     -1.438797      -1.463035     -1.481911 -1.454579 -1.454579 -1.465404 -1.423409 -1.454579 -1.474801  -1.455609  -1.459480  -1.481911  -1.438797  -1.479379       0         0

(None, None)

In [5]:
from IPython.display import display

In [6]:
ch._query_df(Adb.client, "select id from tiles group by id having count(*) > 1")

Empty DataFrame
Columns: [id]
Index: []

In [7]:
ch._query_df(Bdb.client, "select id from tiles group by id having count(*) > 1")

                    id
0  4373889141130919936

In [8]:
ch._query_df(Bdb.client, "select id from results group by id having count(*) > 1")

                    id
0  4373889141130919936

In [9]:
ch._query_df(Bdb.client, "select id from done group by id having count(*) > 1")

                    id
0  4373889141130919936

In [10]:
ch._query_df(Bdb.client, 'select * from done where id = 4373889141130919936')

,step_id,step_iter,id,active,selection_time,worker_id,refine,deepen
0,0,0,4373889141130919936,0,1.674261e+09,3,1,0
1,0,0,4373889141130919936,0,1.674261e+09,3,0,1

In [11]:
ch._query_df(Bdb.client, 'select * from tiles where id = 4373889141130919936')

,id,active,parent_id,theta0,radii0,null_truth0,K,worker_id,step_id,step_iter,creation_time
0,4373889141130919936,1,4373888591374581760,-0.75,0.25,1,8192,0,0,0,0.0
1,4373889141130919936,1,4373888591374581760,-0.25,0.25,1,8192,0,0,0,0.0

In [13]:
ch._query_df(Bdb.client, 'select * from results where id = 4373889141130919936').columns

Index(['id', 'active', 'parent_id', 'theta0', 'radii0', 'null_truth0', 'K',
       'step_id', 'step_iter', 'creation_time', 'worker_id', 'processing_time',
       'eligible', 'grid_cost', 'impossible', 'orderer', 'alpha0',
       'twb_max_lams', 'twb_mean_lams', 'twb_min_lams', 'lams', 'B_lams0',
       'B_lams1', 'B_lams2', 'B_lams3', 'B_lams4', 'twb_lams0', 'twb_lams1',
       'twb_lams2', 'twb_lams3', 'twb_lams4'],
      dtype='object')

In [65]:
for step_id in range(14):
    AA = At.loc[At['step_id'] == step_id]
    BB = Bt.loc[Bt['step_id'] == step_id]
    print(step_id, AA.shape, BB.shape)
    if AA.shape[0] != BB.shape[0]:
        display(AA)
        display(BB)

0 (2, 31) (2, 31)
1 (3, 31) (3, 31)
2 (4, 31) (4, 31)
3 (5, 31) (5, 31)
4 (6, 31) (6, 31)
5 (7, 31) (7, 31)
6 (11, 31) (11, 31)
7 (19, 31) (19, 31)
8 (35, 31) (35, 31)
9 (60, 31) (60, 31)
10 (61, 31) (61, 31)
11 (62, 31) (62, 31)
12 (0, 31) (0, 31)
13 (0, 31) (0, 31)